{
  "description": "Uma estrutura de um banco de dados, diferentemente de um software, tende a deteriorar com o passar do tempo. Dentre várias causas podemos citar: (i) o crescimento progressivo do volume de dados devido ao aumento natural de usuários que o utilizam, e (ii) o tempo de uso, tornando um modelo de dados que no início era eficiente para solução proposta em um modelo ineficiente e defasado.\n\nEssa deterioração aliada a mudanças em requisitos de negócio exigem refatorações tanto no software quanto em seus bancos de dados. Porém a refatoração de um banco de dados é mais complexa que a de um software, pois: (i) além de manter comportamento também é necessário manter as informações (dados) e (ii) acoplamento com diversas origens (outras apps, frameworks, integrações, etc).\n\nDevido a essas dificuldades a evolução de uma estrutura de banco de dados torna-se um desafio, ocorrendo assim um fenômeno conhecido como Bad Smells (mal cheiros), da mesma forma que ocorre com o código de um software. Em software um code smell (bad smell) é uma categoria comum de problema no código fonte que indica a necessidade de refatoração, e o mesmo ocorre com bancos de dados, onde são chamados database smells.\n\nAlguns exemplos de database smells:\n* Multi-purpose column \n* Multi-purpose table \n* Redundant data \n* Tables with many columns\n* \"Smart\" columns\n* Lack of constraints\n* Fear of change\n\nDentre os database smells citados acima, devemos ter atenção especial ao \"Fear of change\", pois pode ser considerado o pior de todos, pois:\n* inibe inovação, \n* reduz efetividade, \n* produz ainda mais bagunça\n* ao longo do tempo a situação fica cada vez pior. \n\nLembra do valor \"Coragem\" do XP (eXtreme Programming)? Mudança é algo que deve ser considerado natural e irá acontecer em projetos de software, isso é um fato, não podemos fugir disso, então precisamos das práticas e ferramentas adequadas para que a mudança não seja um entrave na evolução do seu projeto, e sim algo natural e, de certa forma, trivial para s",
  "duration": 0,
  "language": "por",
  "recorded": "2016-07-14",
  "slug": "bad-smells-mal-cheiros-em-bancos-de-dados",
  "speakers": [
    "Fabrízio de Royes Mello"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL17",
    "Bancos de Dados"
  ],
  "title": "Bad Smells (mal cheiros) em Bancos de Dados",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl17/41b/sala41b-high-201607140900.ogv"
    }
  ]
}
