{
  "description": "Nos últimos dois anos, desenvolvemos dentro da Visagio Tecnologia, uma ferramenta de gestão de processos baseado no software open source Redmine e o BPMS Activiti (também open source). Mais de 500 processos/subprocessos diferentes já foram mapeados dentro da ferramenta, envolvendo mais de 10 mil pessoas em 4 continentes, incluindo a automatização de processos de Centros de Serviços Compartilhados.\n\nCom a crise econômica, automatizar e gerenciar processos internos se tornou essencial para cortar custos e identificar gargalos, mas, ao buscar ferramentas que ajudam nessa tarefa, o alto investimento das opções tradicionais torna-se uma barreira. Quando empresas resolvem aderir a uma ferramenta de baixo investimento (como Excel), ou mesmo à utilização de e-mails como forma de comunicação e controle dos processos, sofrem com a falta de suporte e flexibilidade, muitas vezes deixando o processo (que era o problema inicial) mais burocrático e menos otimizado.\n\nPensando em superar as três grandes barreiras encontradas pelas empresas na implementação de uma solução para o controle de seus processos – o alto investimento inicial; a ausência de um suporte direcionado, com a adoção de ferramentas de código aberto; e a falta de flexibilização – a Visagio desenvolveu, a partir do Redmine, o Visagio Process Manager (VPM).\n\nO intuito da palestra é mostrar o potencial de transformação de ferramentas open source para atender o cliente, uma prática pouco abordada na venda/implementação de softwares de prateleira fechados.",
  "duration": 0,
  "language": "por",
  "recorded": "2016-07-14",
  "slug": "uma-alternativa-flexivel-para-o-controle-de-processos",
  "speakers": [
    "Victor Lima Campos"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL17",
    "Negócios, Migrações e Casos"
  ],
  "title": "Uma Alternativa Flexível para o Controle de Processos",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl17/41f/sala41f-high-201607140859.ogv"
    }
  ]
}
