{
  "description": "Algum tempo atrás estar preparado para um milhão de usuários simultâneos era somente para as grandes empresas como Google, twitter ou facebook. Mas com a explosão da Web 2.0 isso também é uma preocupação para qualquer que tenha um site de notícias ou mesmo um ecommerce. Somado as atualizações cada vez mais frenéticas (tecnológicas ou de regras denegócio) para fazê-lo sobreviver a concorrência acaba-se desprezando boas práticas para atender a audiência cada vez mais maior. Então, seu site está preparada para um milhão de usuários?\n\nA cada dia surge novas tecnologias para produção de sistemas/site\ntornando difícil acompanhar todas elas ou escolher as melhores. Porém\né possível escolher algumas técnicas e práticas importantes para\ninternet e seu ecossistema. A Web 2.0, expansão do comércio\neletrônico, redes sociais, a \"Internet das Coisas\" e outros buzzwords\ntornam as escolhas tecnológicas cada vez mais difíceis de serem\ntomadas pela enormidade de opções. Mas é possível considerar algumas\ncoisas para que um site/sistema proporcione uma boa experiência para\nseu usuário e alguma vida para as equipes de TI. Algumas delas são:\n\n- limitações dos navegadores web,\n- sprite de imagens,\n- minify css e javascripts,\n- segmentação de domínios,\n- cache,\n- servidores web (http),\n- limitações geográficas,\n- arquitetura computacional do site/sistema,\n- funcionanamento do HTTP,\n- indexação nos mecanismo de pesquisa,\n- a expectativa de 1 milhão de usuários simultâneos.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-09",
  "slug": "como-suportar-um-milhao-de-usuarios-simultaneos",
  "speakers": [
    "Fernando Ike"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Ferramentas, Metodologias e Padrões"
  ],
  "title": "Como suportar um milhão de usuários simultâneos?",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41e/sala_41e-high-201507091900.ogv"
    },
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41e/sala_41e-high-201507091902.ogv"
    }
  ]
}
