{
  "description": "Na última década, a expansão prodigiosa da Internet vem revolucionando as formas de comunicação, de acesso à informação e de realização de negócios em todo o mundo. Mas a que se deve este fenômeno? Basicamente, deve-se ao seu potencial para atingir instantaneamente um grande número de pessoas, independentemente de localização geográfica e de contexto sócio-cultural.\n\nO computador e a Internet representam um enorme passo para a inclusão de pessoas com deficiência, promovendo autonomia e independência. Muitas vezes, a deficiência não é severa o suficiente a ponto de tornar-se uma barreira à utilização do computador. Entretanto, na maioria das páginas da Web, as pessoas cegas ou com baixa visão, pessoas com deficiência auditiva, com dificuldade em utilizar o mouse, por exemplo, encontram barreiras de acessibilidade que dificultam ou impossibilitam o acesso aos seus conteúdos.\n\nNeste contexto, a inacessibilidade de sítios eletrônicos exclui uma parcela significativa da população ao acesso às informações veiculadas na internet. A acessibilidade à Web refere-se a garantir acesso facilitado a qualquer pessoa, independente das condições físicas, dos meios técnicos ou dispositivos utilizados. No entanto, ela depende de vários fatores, tanto de desenvolvimento quanto de interação com o conteúdo.\n\nNossa intenção com essa palestra é de mostrar algumas dicas de como construir um site acessível, mostrando os erros mais comuns e apresentando soluções para estes. Além disso disponibilizaremos insumos sobre este assunto, tais como livros, cartilhas, links, artigos entre outros.\n\nEssa palestra é baseada no Modelo de Acessibilidade do Governo Eletrônico - eMAG 3.1, um documento de recomendações de acessibilidade construído para nortear o desenvolvimento web acessível no Brasil, o qual os autores desta palestra também são colaborares.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-10",
  "slug": "construindo-um-site-acessivel",
  "speakers": [
    "Lael Nervis",
    "Ricardo Moro"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Ferramentas, Metodologias e Padrões"
  ],
  "title": "Construindo um site acessível",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41f/sala_41f-high-201507101359.ogv"
    }
  ]
}
