{
  "description": "FreeCAD é uma aplicação de modelagem 3D genérica, aberta e multiplataforma, feita para o design de produtos, ou seja, objetos que vão existir no mundo real. O projeto está agora ganhando muito foco, principalmente graças ao surgimento e espalhamento rápido da impressão 3D caseira, e da sua grande abertura ao hacking.\n\nFreeCAD pode ser descrito como uma grande \"colagem\" de vários outros projetos de software livre, tal como OpenCasCade (o nosso kernel geométrico), Coin3D (uma implementação do OpenInventor, que gerencia a vista 3D), Qt e python. Mas pode também, mais adequadamente, ser chamado de \"Python beast\". Com um pouco de conhecimento da linguagem Python, o usuário ganha os poderes de um deus.\n\nApesar dele ser programado principalmente em C++, o Python está em todo lugar no FreeCAD: Funciona como uma \"cola\" entre a base da aplicação, que faz todas as operações geométricas pesadas, e a interface gráfica. Isso oferece inúmeras possibilidades apetitosas, como a separação do FreeCAD entre sua interface e a base, que pode funcionar como servidor, e a possibilidade de gravar, modificar, ou interagir com o fluxo de Python que corre entre as partes, e muito mais. Todos os projetos livres usados no FreeCAD também tem suas próprias conexões com Python, todas acessíveis de dentro do FreeCAD, todas conectadas com a aplicação e podendo atuar no seu conteúdo, interface e vistas 3D.\n\nO código Python está também constantemente exposto ao usuário, o que torna a aplicação extremamente pedagógica. É quase impossível usar o FreeCAD e não aprender sem querer um pouco de Python. Muitos já tentaram.\n\nIsso ajudou a formar uma comunidade muito avançada tecnicamente em volta do FreeCAD, onde as diferenças entre desenvolvedor e usuário se apagaram.\n\nEsta palestra tentará mostrar um pouco da incrível experiência \"socio-técnica\" que temos construindo essa ferramenta feita para construir.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-11",
  "slug": "freecad-uma-plataforma-de-design-hackeavel",
  "speakers": [
    "Yorik van Havre"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Aplicações Desktop"
  ],
  "title": "FreeCAD - uma plataforma de design hackeável",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41a/sala_41a-high-201507111105.ogv"
    }
  ]
}
