{
  "description": "Esta palestra irá apresentar um panorama geral dos hackerspaces no mundo, dando enfoque especial às iniciativas de hackerspaces feministas, focados em fomentar uma maior participação de mulheres no campo das tecnologias da informação.\n\nTambém irá apresentar em detalhes as ações do coletivo brasileiro MariaLab, um espaço criado por mulheres e para mulheres, no qual elas não sejam minoria. Um coletivo voltado para o empoderamento, aprendizado e ensino de tecnologia, por meio de práticas inclusivas e colaborativas.\n\nA grande maioria dos hackerspaces no Brasil e no mundo, embora sejam receptivos com as mulheres, não só têm uma maioria de frequentadores masculina como, por conta disso, acabam causando insegurança e desconforto para as mulheres poderem errar e aprender sem medo.\n\nPor meio da criação de espaços não necessariamente exclusivos a mulheres, mas que estejam atentos também às demandas específicas de um coletivo inclusivo a minorias como gays e transgêneros, hackerspaces feministas estão buscando diminuir a grande desigualdade de gênero ainda existente na ciência e na tecnologia.\n\nPor fim, serão também sugeridas nesta apresetanção formas de mulheres se organizarem em coletivos similares em suas cidades, por meio do engajamento de rede, listas de discussão, e outros meios.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-10",
  "slug": "hackerspaces-feministas-reduzindo-a-desigualdade-de-genero-na-tecnologia",
  "speakers": [
    "Carine Gomes Roos",
    "Vanessa Martinez Tonini",
    "Fernanda Shirakawa"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Cultura, Filosofia, e Política"
  ],
  "title": "Hackerspaces feministas: reduzindo a desigualdade de gênero na tecnologia",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41b/sala_41b-high-201507101901.ogv"
    }
  ]
}
