{
  "description": "A palestra apresenta o conceito de hardware livre e como essa nova tendência tem ajudado a realizar as aspirações do movimento do software livre. Mas, ao mesmo tempo, também apresenta como a engenharia reversa de dispositvos de eletrônica digital ainda é ferramenta extremamente importante para se efetivar a liberdade dos usuários na operação de computadores.\n\nPor meio da inspeção de sucata eletrônica, leitura de datasheets e do estudo do código-fonte de projetos como MAME (Multiple Arcade Machine Emulator) e MESS (Multi Emulator Super System), podemos entender melhor como funcionam diversos dispositivos de eletrônica digital e interagir com esses equipamentos mesmo depois de tornarem-se raros ou inacessíveis. Podemos também aprender mais sobre técnicas de projeto de hardware e de desenvolvimento de software embarcado, arquiteturas de computador, etc.\n\nAs técnicas que precisamos dominar para desenvolver novos emuladores incluem procedimentos de engenharia reversa que são também muito úteis no processo árduo de criação de soluções livres que substituam os firmwares proprietários utilizados nos mais diversos dispositivos do nosso cotidiano, ou no processo de desenvolvimento de drivers livres para dispositivos sem documentação técnica oficial e no port de sistemas operacionais para novas plataformas de hardware.\n\nNesse sentido, estes conhecimentos de engenharia reversa são ferramentas essenciais para a reconquista da autonomia no uso de computadores de hoje em dia. Precisamos formar uma comunidade de hardware hackers habilidosos na prática de engenharia reversa, para que possamos solucionar os problemas de liberdade dos usuários denunciados por projetos como o Linux-Libre.\n\nPor fim, a criação de dispositivos de hardware livre tem se mostrado um forte aliado do movimento do software livre, em um momento em que mecanismos maliciosos gradativamente migram dos softwares proprietários para dentro dos próprios chips dos nossos computadores pessoais.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-09",
  "slug": "hardware-livre-e-engenharia-reversa-de-dispositivos-digitais",
  "speakers": [
    "Felipe Corrêa da Silva Sanches"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Hackerspaces",
    "Garoa Hacker Clube",
    "Hardware Livre",
    "Engenharia Reversa",
    "Eletrônica Digital",
    "Emulação",
    "Firmware",
    "MAME",
    "Arcade",
    "Retrocomputação",
    "Assembly",
    "Interoperabilidade",
    "Preservação Histórica"
  ],
  "title": "Hardware Livre e Engenharia Reversa de Dispositivos Digitais",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41f/sala_41f-high-201507091505.ogv"
    }
  ]
}
