{
  "description": "IMPORTANTE: esta palestra também abordará aspectos fundamentais de administração de redes de computadores e de sistemas, além da sua segurança.\n\nO inotify (inode notify) faz parte do Linux e é responsável por fazer o kernel observar os filesystems em operação, avisando aos programas sobre alterações ocorridas. Um exemplo disso é quando copiamos um arquivo via shell e o mesmo é mostrado, imediatamente, em um programa gráfico de gerenciamento de arquivos, como o Dolphin (KDE) ou o Nautilus (Gnome). Esse programa gráfico sempre será avisado sobre essas alterações, em tempo real, pelo Kernel Linux (ação do inotify). Assim como os arquivos, diretórios também poderão ser monitorados.\n\nO iWatch é um programa que utiliza o inotify para observar ocorrências com arquivos e diretórios no disco, podendo disparar gatilhos para executar ações em situações específicas.\n\nAlgumas operações de administração de sistemas e de segurança de rede que poderão ser realizadas com o iWatch e similares:\n\n- Observação de invasões em redes de computadores, obtendo alertas em tempo real, criando-se algo em torno de um elemento verificador de integridade.\n- Backup instantâneo de arquivos, sempre que os mesmos forem alterados.\n- Remoção de dumps de bancos de dados, imediatamente após o backup para um servidor específico.\n- A criação de um sistema de DHCP primário e secundário, similar ao que ocorre com o DNS.\n- Criação de um sistema inteligente de repositório local Debian, para pacotes personalizados, também servindo para outras dostribuições.\n\nAs ações poderão ser desencadeadas após observações de operações triviais de disco, como a criação de um arquivo ou diretório, ou a sua alteração, ou apenas a sua leitura, ou a sua deleção. Há diversas possibilidades, culminando com o monitoramento dos metadados do arquivo.\n\nOutros programas que utilizam o inotify, como clsync, entr, incron, inosync, inotail e inoticoming também serão abordados.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-11",
  "slug": "inotify-observando-seus-arquivos-e-tomando-decisoes-de-seguranca-em-tempo-real",
  "speakers": [
    "João Eriberto Mota Filho"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Segurança"
  ],
  "title": "inotify: observando seus arquivos e tomando decisões de segurança em tempo real",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/40t/sala_40t-high-201507111400.ogv"
    }
  ]
}
