{
  "description": "O uso de frameworks multiplataformas no desenvolvimento de aplicativos mobile é muito útil porque te economiza tempo, já que você não vai precisar escrever programas do zero para cada um dos sistemas operacionais. \n\nO Cordova já é muito utilizado com sucesso através o PhoneGap. No entanto, aplicativos feitos com PhoneGap, muitas das vezes tendem a ficar com o código desorganizado e difícil de ser compreendido. Outro problema grave era a necessidade de usar bibliotecas JavaScript pesadas, como jQuery, para facilitar o desenvolvimento, prejudicando muito a performance do aplicativo.\n\nO Ionic acaba com esses problemas.\n\nAlém de contar com todas as vantagens do Cordova que já estavam presentes no PhoneGap, o Ionic resolve tanto a falta de organização do código quanto os problemas de performance com AngularJS e Sass.\n\nE é muito fácil começar a desenvolver aplicativos para celular com Ionic. Tudo o que você precisa saber é HTML, CSS e JavaScript, ou seja, se você já fez algum site, está mais do que preparado para fazer seus apps mobile. Não se preocupe porque AngularJS você aprende no caminho! O Ionic foi desenvolvido para ser simples e divertido de aprender e criar com ele.\n\nO objetivo dessa palestra é mostrar do que o Ionic é capaz, apresentando exemplos de aplicativos feitos com ele e ensinando como dar os primeiros passos. Além de desmistificar a ideia de que aplicativos mobile multiplataforma são lentos, mostrando as vantagens de se utilizar um framework híbrido ao invés de partir logo para o desenvolvimento nativo.\n\nObs: a equipe de desenvolvimento está prometendo ainda para esse ano Push Notifications para o Ionic. Não estava disponível até o envio dessa proposta, mas sendo liberado até a data do FISL, certamente será um assunto abordado, com muita felicidade, na palestra.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-09",
  "slug": "ionic-elevando-o-nivel-do-seu-app-multiplataforma-com-cordova-angularjs-e-sass",
  "speakers": [
    "Diego Moreira Guimarães"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Ferramentas, Metodologias e Padrões"
  ],
  "title": "Ionic: Elevando o nível do seu app multiplataforma com Cordova, AngularJS e Sass",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41f/sala_41f-high-201507091555.ogv"
    },
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41f/sala_41f-high-201507091559.ogv"
    },
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41f/sala_41f-high-201507091649.ogv"
    }
  ]
}
