{
  "description": "Conheça o Uncreated.net, um estúdio coletivo de arquitetura e design, com custo zero, gasto de recursos zero, e que funciona como um grupo autônomo (sem empresa), desde 2006 usando e desenvolvendo software livre.\n\nO coletivo é um usuário voraz de software livre: Na sua gestão, na web, e em toda a cadeira de aplicativos necessária para o desenvolvimento de projetos de arquitetura. Isso inclui por exemplo Debian, Ubuntu, WordPress, ProjectPier, Blender, Gimp, FreeCAD, Inkscape, Libre Office, ownCloud e muitos outros. Para adaptar o processo habitual usado por arquitetos, geralmente dependentes de software proprietário caríssimo, ao software livre, foi necessária muita disposição, e desenvolver o que não existia. Isso gerou também novas ideias, novas pistas e novas maneiras de solucionar problemas.\n\nEsse caminho pelo software livre, pela recusa de soluções empacotadas, comerciais, e em muitos casos tóxicas e desenhadas para provocar dependência, encontrou uma ressonância direta com a própria arquitetura desenvolvida pelo coletivo. Também passamos a promover uma arquitetura livre, colaborativa, que fuja da dependência de produtos industriais.\n\nO uso do software livre também permite um custo de funcionamento extremamente baixo, o que simplifica toda a parte administrativa, ao ponto de funcionar sem empresa (todos os membros são autônomos).\n\nEsta palesta se organiza como uma conversa animada e divertida sobre os diversos temas e desafios que encontramos na nossa jornada e como o software livre nos ajuda a sobreviver competindo no mundo corporativo.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-11",
  "slug": "o-dia-a-dia-de-um-estudio-de-arquitetura-livre",
  "speakers": [
    "Maíra Zasso",
    "Yorik van Havre"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Negócios, Migrações e Casos"
  ],
  "title": "O dia-a-dia de um estúdio de arquitetura livre",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41a/sala_41a-high-201507111558.ogv"
    }
  ]
}
