{
  "description": "Apresentação da versão de desenvolvimento  (2.9) do GIMP e suas principais funcionalidades.\n\nA versão atual do GIMP é seguramente a que vai introduzir mais mudanças desde que começaram a sair versões estáveis. Essa apresentação demonstra algumas das capacidades do programa, e principalmente, as novas funcionalidades já implementadas depois da versão 2.8. \n\nEntre as funcionalidades apresentadas temos: imagens com maior profundidade de cor (16, 32 e 64 bits de cor por canal), rotação da tela de pintura, ferramentas de distorção interativa e deformação por grade, pintura em espelho, novas dnâmicas de pintura, uso interno da GEGL, transformação geométrica unificada, busca textual de plug-ins e ferramentas, uso de cores perceptuais para operações nas imagens, dentre outras.\n\nDicas de como instalar a versão de desenvolvimento, e acompanhar ao vivo a evolução do programa.\n\nO GIMP (GNU Image Manipulation Program) é o principal programa para Desktop em Software Livre para manipular imagens, podendo servir tanto para finalização de fotográfias, criação de novas imagens, como para pesquisa acadêmica na área de processamento de imagens. Compete em ordem de grandeza com as principais alternativas proprietárias, e está disponível para todas as distribuições desktop GNU/Linux, bem como para outros sistemas operacionais. \n\nEm desenvolvimento desde 2012, a versão \"master\" no GIT se distânciou bastante da versão estável atual (2.8.14), principalmente na representação interna das imagens que passou de 8 bits por canal  de cor (máximo de 256 tonalidades) para um número virtualmente ilimitado de cores por canal (32 bit em ponto flutuante), que preservam detalhes de claro e sombra sem \"estourar\" a imagem, mesmo após dezenas de etapas de processamento.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-09",
  "slug": "o-gimp-do-futuro",
  "speakers": [
    "João Sebastião de Oliveira Bueno"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Aplicações Desktop"
  ],
  "title": "O GIMP do Futuro",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41f/sala_41f-high-201507091658.ogv"
    },
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41f/sala_41f-high-201507091701.ogv"
    }
  ]
}
