{
  "description": "O MCI teve grande notoriedade no ano de 2014, ano de sua aprovação. Isso aconteceu mais de cinco anos depois da primeira consulta do MCI,no Culturadigital.br, plataforma livre e aberta do Ministério da Cultura. Considerando que a lei teve como um dos pontos de partida o Forum Internacional de Software Livre (FISL), e que passou ainda por um longo processo de tramitação no Congresso Nacional, este painel traz para o debate trabalhos acadêmicos que analisaram os diversos momentos até a aprovação da lei e apresentam avaliações sobre os aspectos legais, o ativismo, as disputas políticas e questões resultantes da aprovação da lei. \n\n\nFabricio Solagna realizou sua pesquisa de Mestrado em sociolgia na UFRGS sobre o processo de agenda e aprovação do Marco Civil. No seu trabalho acadêmico dedicou-se a mapear as diversas redes de suporte ao MCI. Além de pesquisador, também trabalha como consultor em metodologias de participação digital para a Secretaria Geral da Presidência da República.\n\nFabro Steibel tem 10 anos de experiência em comunicação, governo\naberto e liberdade de expressão. Publicou diversas pesquisas sobre a\nconsulta pública do Marco Civil no Culturadigital.br, e criou\nplataformas de consulta com outras tecnologias. É o relator\n(pesquisador independente) da Parceria de Governo Aberto, auditando o\n2o Plano de Governo Aberto do Brasil. É fellow de governo aberto da\nOEA, professor de comunicação digital na ESPM Rio, e Coordenador Geral\nde Projetos no Instituto de Tecnologia e Sociedade do Rio de Janeiro,\ntrabalhando com a equipe que coordenou com o Ministério da Justiça a\nprimeira consulta do Marco Civil.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-09",
  "slug": "o-marco-civil-depois-de-1-ano",
  "speakers": [
    "Fabricio Solagna",
    "Fabro Steibel",
    "Anna Carolina Papp"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Governança da Internet"
  ],
  "title": "O Marco Civil depois de 1 ano",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41c/sala_41c-high-201507091400.ogv"
    }
  ]
}
