{
  "description": "A proposta do painel é apresentar diferentes plataformas utilizadas em diferentes espaços de governo e da sociedade civil, que tem como o objetivo melhorar o engajamento civil, propiciar meios de participação política dos cidadãos com os governos e facilitar a tomada de decisões. O painel pretende demonstrar os avanços dessas plataformas para a democracia participativa e direta, abordando experiências concretas de como o desenvolvimento colaborativo do software livre pode envolver os cidadãos de forma participativa nos projetos.\nNeste painel serão apresentados apenas projetos que possuem o código aberto.\n\nParticipa.br - Plataforma utilizada pela Presidência da República para participação social\nRicardo Poppi - Graduado em Ciência Política pela UnB, responsável pelo Participa.br, ambiente online de participação social do Governo Federal. É entusiasta de webcidadania e software livre para Participação Social.\n\nE-Democracia (Laboratório Hacker da Câmara dos Deputados)\nCristiano Ferri - Diretor do Laboratório Hacker da Câmara dos Deputados, responsável pelo ambiente de participação social da Camara dos Deputados, o E-democracia \n\nCidade Democrática\nRodrigo Bandeira - fundador e diretor-executivo do Instituto Cidade Democrática e mestre em Administração Pública e Governo e graduado em Administração de Empresas pela FGV-SP. Escreve artigos e oferece cursos e palestras sobre o Futuro Digital da Democracia, Articulação Intersetorial e Colaboratividade.\n\nAgora Delibera (Pensando o Direito/MJ)\nMarco Konopacki - Mestre em Ciência Política pela Universidade Federal do Paraná, desenvolve e pesquisa tecnologias para participação desde 2010. Desde 2014 é Assessor para Novas Tecnologias e Participação na Secretaria de Assuntos Legislativos do Ministério da Justiça.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-09",
  "slug": "o-software-livre-pode-ajudar-a-democracia-plataformas-abertas-para-democracia-d",
  "speakers": [
    "Fabricio Solagna",
    "Marco Antonio Konopacki (Marco Amarelo)",
    "Ricardo Poppi",
    "Henrique Parra",
    "Rosane Maria Ludtke Leite",
    "Livia Ascava"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Governança da Internet"
  ],
  "title": "O software livre pode ajudar a democracia? Plataformas abertas para democracia d",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41d/sala_41d-high-201507091608.ogv"
    }
  ]
}
