{
  "description": "A proposta principal desse espaço é trazer para discussão a existência de poucas mulheres que compõem o cenário no mundo tecnológico é algo que tem chamando muita atenção atualmente, mas qual, ou quais, fatores fazem com que se tenha essa baixa quantidade de mulheres atuando na área de TI?\nO principal fator ainda é o social, o qual designa que uma mulher não deve ser uma profissional de TI, pois cabe ao homem essa área e que mulheres devem trabalhar nas áreas que não tenham foco em exatas.\nAcompanhando esse fator vem o preconceito de que uma mulher não pode ser capaz de se interessar por computação, assim como as outras áreas de exatas, e nem possa ser uma profissional capaz de desempenhar de maneira satisfatória as mesmas funções que homens.\nOutro fator que também tem peso para essa realidade é o esteriótipo de que a mulher que trabalha com tecnologia tem que ser totalmente sem vaidades, antissocial e introvertida. Muitas com medo de serem rejeitadas e discriminadas acabam por buscar outras carreiras.\nE quando estas poucas mulheres que de maneira corajosa decidem enfrentar tudo e seguir na área, os professores e colegas tentam direcioná-las para papeis que consideram ser os mais “indicados” para realizar, como engenharia de software, IHC, entre outras,usando como desculpa a frase “Mulher é boa com estética”,não percebem que ainda assim estão agindo de maneira preconceituosa, pois uma mulher pode perfeitamente atingir destaque atuando com programação de baixo nível, Hardware, Computação Grafica,áreas que exijam cálculo,etc.\nMas, o que muitos esquecem é que dentre as principais figuras pioneiras na tecnologia as de maior destaque estão grandes mulheres, aquelas que tanto são rejeitadas. A primeira representante histórica trata-se de Ada Lovelace,conhecida como a pessoa que primeiro trabalhou com programação. O papel da diversidade está em mostrar diferentes pontos de vista para atingirmos um melhor resultado em nossos trabalhos, pois computação é coisa de mulher Sim!",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-11",
  "slug": "painel-mulheres-da-ti-e-nas-comunidades-de-software-livre",
  "speakers": [
    "Claudia Maria da Costa Archer",
    "Christiane Borges Santos",
    "Melissa Devens",
    "Márcia Santos Almeida",
    "Desiree Santos"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Cultura, Filosofia, e Política"
  ],
  "title": "Painel: Mulheres da TI e nas Comunidades de Software Livre",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41c/sala_41c-high-201507111401.ogv"
    }
  ]
}
