{
  "description": "A ascenção da era mobile é claramente percebida pela nossa realidade atual. Cada dia são lançados novos modelos de smarthphones, tablets; entre outros. Grandes players e fabricantes móveis participam ativamente desta constante evolução. Essa evolução para a era mobile afeta a forma como nos comunicamos e nosso comportamento em frente a um mundo cheio de novidades. A era mobila está presente em diversos ramos e atividades como na educaçào, entretenimento e negócios. As pessoas compram apps mesmo sem nunca ter comprado um software. Qualquer desenvolvedor com visão empreendedora que visa inovação e crescimento percebe esta mudança e nela pode explorar oportunidades de negócio. Desenvolver apps para dispositivos móveis que sejam instalados e executados em diversas plataformas é possível atualmente por meio das seguintes tecnologias web HTML5, CSS3 e JavaScript. Após o advento dessas tecnologias no mundo móvel, surgiram inúmeros frameworks e em seguida a divisão de soluções móveis em três categorias: Nativas, WebApps e Híbridas. As apps nativas são as criadas exclusivamente para uma plataforma; As WebApps usam as tecnologias web já citadas para a sua criação e executam em um navegador no dispositivo; e na categoria dos aplicativos híbridos, tem-se a junção de características nativas e webapps. Uma solução híbrida é construída utilizando tecnologias web, como JavaScript, contudo pode ser empacotada e exportada de forma semelhante a uma aplicação desenvolvida em linguagem original/nativa da plataforma, podendo ainda ser feito o download em uma loja de apps (Google Play, App Store, etc) e instalada normalmente. A presente palestra apresentará a IDE Intel® XDK, solução livre desenvolvida pela Intel,  que fornece uma série de ferramentas-chave para os desenvolvedores criarem apps móveis multiplataforma, utilizando HTML5,  com características híbridas. A IDE integra modelos de projetos, emulador, depurador e ferramentas de publicação para as lojas de aplicativos.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-10",
  "slug": "revolucao-harmonica-entre-webapps-e-apps-moveis-nativos-intel-xdk",
  "speakers": [
    "Frederico Guilherme Klüser de Oliveira",
    "Frederico Guilherme Klüser de Oliveira"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Ferramentas, Metodologias e Padrões"
  ],
  "title": "Revolução harmônica entre webapps e apps móveis nativos: Intel XDK",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41f/sala_41f-high-201507101502.ogv"
    }
  ]
}
