{
  "description": "O mundo de hoje oferece desafios muito maiores do que o que costumávamos viver. Alguns dizem que a privacidade morreu. De certa maneira para a maioria das pessoas, atualmente isso é verdade. Isso porque, quando existem agencias governamentais com tamanho poder, verba, e influência, fica difícil para qualquer um manter sua privacidade. O mundo pós Snowden, descobriu que suas maiores empresas de tecnologia, foram coagidas a fornecer dados para a NSA e seus aliados. Sabemos também que a espionagem já é presente mesmo a nível de hardware, com firmwares modificados antes mesmo, ou posterior a saida da fábrica. Como podemos combater tamanho poderio? Pensando em todo esse complexo cenário surgiu um ambicioso projeto chamado UVST (User Verifable Social Telematics). Este projeto visa criar uma plataforma computacional, ultra-seguro através da total e completa verificabilidade pelo usuário desde o processo da manufatura, até a implementação dos serviços. Utilizando-se exclusivamente se software livre e de código aberto, o projeto contempla a utilização de toda uma gama de equipamentos seguros indo desde servidores com processadores seguros até a criação de desktops e dispositivos portáteis. Em seu produto final oferecerá serviços de comunicação segura como, e-mail, chat, web, e voz. Nessa palestra explicarei alguns pontos de como isso será feito. Venha saber como você pode ajudar a mudar o mundo como conhecemos.",
  "duration": 0,
  "language": "por",
  "recorded": "2015-07-08",
  "slug": "uvst-a-plataforma-segura-aberta-e-confiavel-que-pode-vencer-a-espionagem",
  "speakers": [
    "Alberto J. Azevedo"
  ],
  "tags": [
    "Software Livre",
    "FISL",
    "FISL16",
    "Segurança"
  ],
  "title": "UVST. A plataforma segura, aberta e confiável que pode vencer a espionagem",
  "videos": [
    {
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/fisl16/high/41a/sala_41a-high-201507081403.ogv"
    }
  ]
}
