{
  "copyright_text": "CC BY",
  "description": "O Brasil já conta com 84 milhões de usuários de Internet. O país é o quarto com mais empresas conectadas. Somos o terceiro maior país do mundo em número de Internautas. Passamos mais de 61 horas por mês conectados na Internet. A Internet já é a segunda ferramenta utilizada pelo eleitor para decidir seu voto. Pesquisas revelam que 12% dos eleitores utilizam a Internet com prioridade, na hora de formar sua decisão de voto. Poucos partidos, coligações e candidatos despertaram para a importância de um digital team apto a extrair as melhores oportunidades da regulamentação da rede, posicionando e gerando buzz positivo, formando opinião e principalmente, monitorando candidato e oposição, identificando irregularidades e procedendo com denúncias a Justiça Eleitoral. Neste cenário, não basta presença na Internet, mas principalmente, contar com um time de inteligência digital que defina melhores estratégias na rede, fidelize pontos de influência e que principalmente, esteja atento a ação de concorrentes, crackers e golpistas, que em simples atos, podem prejudicar completamente uma campanha eleitoral.  Do mesmo modo, uma militância está apta a lidar com o eleitor 2.0 se conhecer as mídias cidadãs, como ele pensa, e as minúcias da legislação aplicada à rede, com o entendimento dos Tribunais nas experiências eleitorais entre 2008 e 2010. Neste sentido, informar, capacitar a militância demonstra-se fundamental. A presente palestra tem objetivo apresentar o atual cenário do ciberativismo no  Brasil, lançar bases para formar estrategistas digitais, aptos a projetarem, implementarem e desenvolverem ações na rede, bem como traçar o cenário futuro relativo ao hacktivismo, este entendido como elemento essencial ao Estado Democrático de Direito e para proteção do cidadão em face das investidas do Estado.",
  "duration": 2139,
  "id": 28,
  "language": "por",
  "recorded": "2013-01-31",
  "related_urls": [
    "http://campuse.ro/events/campus-party-brasil-2013/talk/hacktivismo-e-cyberativismo-guerra-eleitoral-na-internet",
    "http://slcampusparty.com.br/blog/hacktivismo-e-cyberativismo-guerra-eleitoral-na-internet"
  ],
  "slug": "hacktivismo-e-cyberativismo-guerra-eleitoral-na-internet",
  "speakers": [
    "José Antonio Milagre"
  ],
  "tags": [
    "CPBR6",
    "Campus Party Brasil",
    "Software Livre",
    "São Paulo",
    "Hacker",
    "Ciberativismo"
  ],
  "thumbnail_url": "http://hemingway.softwarelivre.org/capturas/hacktivismo-e-cyberativismo-guerra-eleitoral-na-internet.jpg",
  "title": "Hacktivismo e cyberativismo: guerra eleitoral na internet",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=1Nu4XNrcnL0"
    },
    {
      "size": 195295394,
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/videos-diversos/campus-party/cpbr6-2013/cpbr6-2013-hacktivismo-e-cyberativismo-guerra-eleitoral-na-internet.ogv"
    },
    {
      "size": 58668326,
      "type": "webm",
      "url": "http://hemingway.softwarelivre.org/videos-diversos/campus-party/cpbr6-2013/cpbr6-2013-hacktivismo-e-cyberativismo-guerra-eleitoral-na-internet.webm"
    }
  ]
}
