{
  "copyright_text": "CC BY",
  "description": "Uma das maiores dificuldades para os programadores hoje, é escolher uma linguagem de programação e framework que esteja presente nas plataformas e arquiteturas atuais. Atualmente temos Windows, MacOSX, Linux, Android, e IOS, e a grande questão ? Como desenvolver um software nativo para essas plataformas sem ter que reescrever o programa em suas IDE's específicas ? A resposta é o framework que vem crescendo à passos largos chamado Qt. Qt é um framework que tem seu conjunto de classes que abstrai a maioria das funcionalidades necessárias para se desenvolver um aplicativo. Qt Creator também é feita inteiramente usando o framework Qt. Desenvolva seu aplicativo e compile para várias plataformas. Pode até ser que você nunca tenha ouvido falar do Qt, mas ele está no seu dia a dia, podemos destacar a interface gráfica do Linux chamada KDE, Oracle VirtualBOX, um mixador de áudio chamado Mixxx, e o famoso programa de eletrônica chamado Labcenter Proteus. Também muito utilizado na indústria, e em plataformas crítias de tempo real, como QNX e VxWorks, comum em equipamentos industriais, equipamentos de defesa e segurança, equipamentos hospistalares.",
  "duration": 2880,
  "id": 65,
  "language": "por",
  "recorded": "2016-11-11",
  "related_urls": [
    "http://campuse.ro/events/campus-party-minas-gerais-2016/talk/desenvolvendo-em-qt-para-multi-dispositivos"
  ],
  "slug": "desenvolvendo-em-qt-para-multi-dispositivos",
  "speakers": [
    "João Ricardo Pagotto"
  ],
  "tags": [
    "CPMG",
    "Campus Party Minas Gerais",
    "Software Livre",
    "Minas Gerais",
    "Belo Horizonte",
    "Qt",
    "Framework",
    "KDE"
  ],
  "thumbnail_url": "http://hemingway.softwarelivre.org/capturas/desenvolvendo-em-qt-para-multi-dispositivos.jpg",
  "title": "Desenvolvendo em Qt para multi dispositivos",
  "videos": [
    {
      "type": "youtube",
      "url": "https://www.youtube.com/watch?v=WGIRflsGnmQ"
    },
    {
      "size": 134469602,
      "type": "ogg",
      "url": "http://hemingway.softwarelivre.org/videos-diversos/campus-party/cpmg1-2016/cpmg1-2016-desenvolvendo-em-qt-para-multi-dispositivos.ogv"
    },
    {
      "size": 138527210,
      "type": "webm",
      "url": "http://hemingway.softwarelivre.org/videos-diversos/campus-party/cpmg1-2016/cpmg1-2016-desenvolvendo-em-qt-para-multi-dispositivos.webm"
    }
  ]
}
